sische/MasterThesis/NordicExamples5/nrf5_iot_sdk_3288530/examples/iot/coap/ipv6/server_observe/main.c
    // The list of IoT Timer clients is declared as a constant.
    static const iot_timer_clients_list_t iot_timer_clients =
    {
        (sizeof(list_of_clients) / sizeof(iot_timer_client_t)),
        &(list_of_clients[0]),
    };

    // Passing the list of clients to the IoT Timer module.
    err_code = iot_timer_client_list_set(&iot_timer_clients);
    APP_ERROR_CHECK(err_code);

    // Starting the app timer instance that is the tick source for the IoT Timer.
    err_code = app_timer_start(m_iot_timer_tick_src_id, \
                               APP_TIMER_TICKS(IOT_TIMER_RESOLUTION_IN_MS, APP_TIMER_PRESCALER), \
                               NULL);
    APP_ERROR_CHECK(err_code);
}


static void ip_app_handler(iot_interface_t * p_interface, ipv6_event_t * p_event)
{
    uint32_t    err_code;
    ipv6_addr_t src_addr;

    APPL_LOG("[APPL]: Got IP Application Handler Event on interface 0x%p\r\n", p_interface);

    switch(p_event->event_id)
    {
        case IPV6_EVT_INTERFACE_ADD:
#ifdef COMMISSIONING_ENABLED
            commissioning_joining_mode_timer_ctrl(JOINING_MODE_TIMER_STOP_RESET);
#endif // COMMISSIONING_ENABLED
            APPL_LOG("[APPL]: New interface added!\r\n");
            m_display_state = LEDS_IPV6_IF_UP;

            APPL_LOG("[APPL]: Sending Router Solicitation to all routers!\r\n");

            // Create Link Local addresses
            IPV6_CREATE_LINK_LOCAL_FROM_EUI64(&src_addr, p_interface->local_addr.identifier);

            // Delay first solicitation due to possible restriction on other side.
            nrf_delay_ms(APP_RTR_SOLICITATION_DELAY);

            // Send Router Solicitation to all routers.
            err_code = icmp6_rs_send(p_interface,
                                     &src_addr,
                                     &local_routers_multicast_addr);
            APP_ERROR_CHECK(err_code);
            break;

        case IPV6_EVT_INTERFACE_DELETE:
#ifdef COMMISSIONING_ENABLED
            commissioning_joining_mode_timer_ctrl(JOINING_MODE_TIMER_START);
#endif // COMMISSIONING_ENABLED
            APPL_LOG("[APPL]: Interface removed!\r\n");
            m_display_state = LEDS_IPV6_IF_DOWN;
            break;

        case IPV6_EVT_INTERFACE_RX_DATA:
            APPL_LOG("[APPL]: Got unsupported protocol data!\r\n");
            break;

        default:
            //Unknown event. Should not happen.
            break;
    }
}

// Added by Sindre
static char * returnString(int i)
{
		char * navn = "Examplestring";
		return &navn[i];
}		

// Added by Sindre
static char * appendToString(char * originalString, const char * stringToAppend)
{
		if((originalString = malloc(strlen(stringToAppend)+1)) != NULL)	// Apperently this is NULL..?
		{	
			originalString[0] = '\0';  // ?? 
			strcat(originalString, stringToAppend);
		} 
		else 
		{
			//stringToSend = "Malloc failed in appendToString!\n"; // originalString = 
		}
		
}

// Added by Sindre
static void	start_measruing()
{
	
	
		//measuredTWIz = read_reg(READ_Z_AXIS, 0x00); 
		//*str = itoa(measuredTWIz, 10);
		
		//char * new_measurement;
		//new_measurement = itoa((read_reg(READ_Z_AXIS, 0x00)), 10);
				
		//char * currentMeasurement = itoa(read_reg(READ_Z_AXIS, 0x00), 10);
		//stringToSend = currentMeasurement; 
		
		//stringToSend[0] = '\0';   // ensures the memory is an empty string
    //strcat(stringToSend, currentMeasurement);
		
		//char * testString = itoa(1, 10);
		//char * testString = "Sindre\0";
		//const char * testString2 = "Leif\0";
		//char * testString3;
		//sprintf(testString3, "%d", (read_reg(READ_Z_AXIS, 0x00)));
		//sprintf(stringToSend, "%s", "Sindre\0");
		//strcpy(stringToSend, currentMeasurement);
		
		//char *ptr; 
		//ptr = strcat(stringToSend, testString3); 
		
		// TEST: use of list
		//valuesList[counter++] = currentMeasurement;
		
		
		//strcat(stringToSend, testString); 
		
		//sumOfMeasurementsSinceLastCoAP += read_reg(READ_Z_AXIS, 0x00); 
		//numberOfMeasurements++;
		
		//int internalCounter = 0; 
		//appendToString(stringToSend, "Sindrergjmvn");
		 
		//char src[50];
		//const char * src2 = "Leif\0";
		//strcpy(src, "This is the string\0"); 
		
		//strcat(stringToSend, src);
		//stringToSend = "Sindre\0"; 
		//sprintf(stringToSend, "%d", 42);
		
				
		int readread = read_reg(READ_Z_AXIS, 0x00);
		
		char stringa[30];
		int one = 5;
		int two = 921;

		sprintf(stringToSend, "a %d", one);
		
		//stringToSend = stringa; 
		//sprintf(stringToSend, "%s", stringa);
		
		// THIS WORKS when static char * stringToSend; 
		
		//char stringa[50];
		//const char *one = "We";
		//const char *two = "Are";
		//char *three = "Creating\0";
		//char *four = "a\0";
		//char *five = "String\0";
	
		//sprintf(stringa, "%s %s %s %s %s", one, two, three, four, five);

		//*stringToSend = stringa; 
		
		// TO HERE: THIS WORKS
		}


		
static void acceleration_value_get(coap_content_type_t content_type, char ** str)
{
		*str = stringToSend;
		//stringToSend = "";
		
		// TEST: sum of array
		//for (int i = 0; i < counter; i++)
		//{
		//		memcpy(stringToSend, valuesList, i); 
		//		valuesList[i] = 0; 
		//}
	
		//*str = itoa((sumOfMeasurementsSinceLastCoAP/numberOfMeasurements), 10); ///numberOfMeasurements), 10); 
		//sumOfMeasurementsSinceLastCoAP = 0;  
		//numberOfMeasurements = 0; 
	
		//measuredTWIz = read_reg(0x36, 0x00); 
		//*str = itoa(measuredTWIz, 10);
		
		//char * newString1 = "Sindre ";
		//char * newString2 = "er ";
		//char * newString3 = "kul"; 
	
		//snprint(*str, "%s%s", newString2, newString1); 
	
		//strncpy(*str, "test807", sizeof(str));
		//strncpy(*str, "kojhnbg", sizeof(str));
		//strcpy(*str, newString2);

		//gets(newString1); // Does not work
		//gets(newString2); // Does not work

		//strcat(*str, newString1);
		//strcat(*str, newString2);
		//strcat(*str, newString3); 
  
		//*str = "This is a test to see the values 212 58 9765 63 23 219 224"; 
		//*str = "215 2010 154 123 15 215 214 852 950 121 111 215 2010 154 123 15 215 214 852 950 121	111 215 2010 154 123 15 215 214 852 950 121 111 215 2010 154 123 15 215 214 852 950 121 111"; 
		
